HM2_Case2/attempt/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------ 

runApplication blockMesh

runApplication topoSet

runApplication createPatch -overwrite

runApplication decomposePar -force

runParallel $(getApplication)

#------------------------------------------------------------------------------
